/*
    원격 수업 참여 실시 시간
        
        1. 9:30 ~ 12:30
        
        2. 13:30 ~ 16.30
        
        3. 16:30 ~ 18:30
*/

-------------------------------------------------------------------------------------------------------------------------------

-- scott 계정이 가지고 있는 emp 테이블을 복사해서 tmp01 테이블을 만든다.
CREATE TABLE tmp01 
AS
    SELECT
        *
    FROM
        scott.emp
;

SELECT * FROM tmp01;

-- tmp01 의 데이터를 모두 삭제한다.
DELETE FROM tmp01;

rollback;

SELECT * FROM tmp01;

TRUNCATE TABLE tmp01;

SELECT * FROM tmp01;

rollback;

SELECT * FROM tmp01;

-------------------------------------------------------------------------------------------------------------------------------


