-- 조건처리함수를 사용해서 해결하세요.

/*
    1. 사원들의 직급을 우리말로 조회하세요.
        
        MANAGER - 관리자
        SALESMAN - 영업직
        CLERK   - 사원
        ANALYST - 분석가
        PRESIDENT - 사장
*/

/*
    2. 각 부서별로 보너스를 다르게 적용해서 지급하려한다.
        
        10 - 급여의 10%
        20 - 급여의 15%
        30 - 급여의 20%
        를 기존커미션에 더해서 지급하려고 한다.
        만약 커미션이 없는 사람은 0으로 해서 계산하기로 하고
        사원의 
            이름, 부서번호, 급여, 기존커미션, 적용커미션 
        을 조회하세요.
*/

/*
    3. 입사년도를 기준으로 
        80 - 'A'
        81 - 'B'
        82 - 'C'
        그 이외의 해에 입사한 직원은 'D' 등급으로
        
        사원들의
            사원이름, 입사일, 사원등급
        을 조회하세요.
*/

/*
    4. 사원의 이름이 4글자이면 'Mr.' 를 이름앞에 붙이고
        4글자가 아니면 이름뒤에 '사원'을 붙여서 조회하려고 한다.
        사원들의
            사원번호, 사원이름, 사원이름글자수
        를 조회하세요.
*/

/*
    5. 부서번호가 10 또는 20 이면 급여 + 커미션의 결과를 출력하고(커미션이 없으면 0으로 계산)
        그 이외의 부서는 급여만 출력하도록 질의 명령을 작성해서
        
        사원이름, 부서번호, 급여, 커미션, 지급금액
        을 조회하세요.
        
*/

/*
    6. 입사한 요일이 토요일, 일요일인 사원들의 급여를 20% 증가해서 지급하고
        그 이외의 사원은 10% 증가해서 지급하려한다.
        
        사원들의
            사원이름, 입사일, 입사요일, 급여, 계산급여
        를 조회하세요.
*/

/*
    7. 근무개월수가 200개월 이상이면 커미션을 500추가해서 지급하고(커미션이 없으면 0으로 계산)
        근무개월수가 200개월 미만이면 커미션을 현재 커미션만 지급하도록 하려한다.
        사원들의
            사원이름, 커미션, 입사일, 입사개월수, 지급커미션
        을 조회하세요.
*/

/*
    8. 이름의 글자수가 5글자 이상인 사람은 이름을 3글자**를 붙이고
        4글자 이하인 사람은 이름을 그대로 조회하려고 한다.
        
        사원들의
            사원이름, 이름글자수, 변경이름
        을 조회하세요.
*/

-- day04

